C ----------------- Лабораторная работа N 7
C ----------------- Программирование типовых нелинейностей
        EXTERNAL ZN
        WRITE (*,'(A)')'----- Лабораторная работа N7 -----'
        WRITE (*,'(A)')
C ---------------- Исходные данные
        DATA A/2./, B/3./, C/6./, Xn/-5./, Xk/5./, H/0.5/
C ---------------- Начало цикла
        X=Xn
1       Y=ZN(A,B,C,X)
        WRITE(*,2) X,Y
2       FORMAT (1X,'X=',F5.1,2X,'Y=',F6.2)
        X=X+H
        IF (X.LE.Xk) GOTO 1
C ---------------- Конец цикла
        STOP
        END
C ---------------- Подпрограмма-функция
        FUNCTION ZN(A,B,C,X)
        IF (-A.LE.X.AND.X.LE.A) P=0
        IF (X.GE.B) P=C
        IF (-B.GE.X) P=-C
        ZN=P
        RETURN
        END
